export interface IRaster {
  id: number;
  name: string;
  src: string;
  opacity: number;
  xy: L.LatLngBoundsExpression;
  mark: number;
}

export const RASTERS: IRaster[] = [
  {
    id: 1,
    src: '1.webp',
    name: 'Аккустическое загрязнение',
    opacity: 85,
    xy: [
      [51.5537613170305988, 39.0671953669318341],
      [51.788992126217714, 39.3334653559571592],
    ],
    mark: 0,
  },
  {
    id: 2,
    src: '2.webp',
    name: 'Загрязнение воздушного бассейна суммарное аэротехногенное загрязнение',
    opacity: 85,
    xy: [
      [51.788992126, 39.067195367],
      [51.553761317, 39.333465356],
    ],
    mark: 0,
  },
  {
    id: 3,
    src: '3.webp',
    name: 'Загрязнение почвенного покрова бензaпирен',
    opacity: 100,
    xy: [
      [51.5534947137547377, 39.0675525098079959],
      [51.7892131594770220, 39.3338937667103608],
    ],
    mark: 0,
  },
  {
    id: 4,
    src: '4.webp',
    name: 'Загрязнение почвенного покрова нитраты',
    opacity: 100,
    xy: [
      [51.789232762, 39.066277927],
      [51.553773694, 39.334496517],
    ],
    mark: 0,
  },
  {
    id: 5,
    src: '5.webp',
    name: 'Состояние почвенного покрова хлориды',
    opacity: 100,
    xy: [
      [51.5538293055432177, 39.066065201795815],
      [51.7891814368074819, 39.3350024411163091],
    ],
    mark: 0,
  },
  {
    id: 6,
    src: '6.webp',
    name: 'Жизненное состояние зеленых насаждений',
    opacity: 100,
    xy: [
      [51.55281429059435, 39.06612136706727],
      [51.78934592330817, 39.33514360867035],
    ],
    mark: 0,
  },
  {
    id: 7,
    src: '7.webp',
    name: 'Техногенные источники экологического риска',
    opacity: 100,
    xy: [
      [51.55281429059435, 39.06612136706727],
      [51.78934592330817, 39.33514360867035],
    ],
    mark: 0,
  },
  {
    id: 8,
    src: '8.webp',
    name: 'эмиссионная нагрузка выбросов загрязняющих веществ в атмосферу',
    opacity: 100,
    xy: [
      [51.55281429059435, 39.06612136706727],
      [51.78934592330817, 39.33514360867035],
    ],
    mark: 0,
  },
  {
    id: 9,
    src: '9.webp',
    name: 'Социально-экологическая комфортность городской среды',
    opacity: 100,
    xy: [
      [51.55281429059435, 39.06612136706727],
      [51.78934592330817, 39.33514360867035],
    ],
    mark: 0,
  },
];
